# ใช้ Node.js เวอร์ชัน 22 แบบกะทัดรัด
FROM node:22-alpine

# กำหนดโฟลเดอร์ทำงานข้างในคอนเทนเนอร์
WORKDIR /app

# ก๊อปปี้ไฟล์รายชื่อโมดูลเข้าไปก่อน (เทคนิคนี้ทำให้ Docker Build รอบต่อไปเร็วขึ้นมาก)
COPY package*.json ./

# สั่งติดตั้งโมดูล
RUN npm install

# ก๊อปปี้โค้ดทั้งหมดที่เหลือตามเข้าไป
COPY . .

# เปิดประตูพอร์ต (จิมมี่อิงพอร์ต 5000 ตามที่คุณเคยเซ็ตไว้ใน Nginx ถ้าในไฟล์ server.js ใช้พอร์ตอื่น อย่าลืมแก้เลขนะครับ)
EXPOSE 5000

# คำสั่งสตาร์ทเซิร์ฟเวอร์ (อิงจากไฟล์ server.js ที่เห็นในภาพ)
CMD ["node", "server.js"]